{
  "authors": [
    {
      "name": "Carlo Siebenschuh",
      "affiliations": [
        1,
        2
      ]
    },
    {
      "name": "Kyle Hippe",
      "affiliations": [
        1,
        2
      ]
    },
    {
      "name": "Ozan Gokdemir",
      "affiliations": [
        1,
        2
      ]
    },
    {
      "name": "Alexander Brace",
      "affiliations": [
        1,
        2
      ]
    },
    {
      "name": "Arham Khan",
      "affiliations": [
        1
      ]
    },
    {
      "name": "Khalid Hossain",
      "affiliations": [
        2
      ]
    },
    {
      "name": "Yadu Babuji",
      "affiliations": [
        2
      ]
    },
    {
      "name": "Nicholas Chia",
      "affiliations": [
        2
      ]
    },
    {
      "name": "Venkatram Vishwanath",
      "affiliations": [
        2
      ]
    },
    {
      "name": "Rick Stevens",
      "affiliations": [
        1,
        2
      ]
    },
    {
      "name": "Arvind Ramanathan",
      "affiliations": [
        1,
        2
      ]
    },
    {
      "name": "Ian Foster",
      "affiliations": [
        1,
        2
      ]
    },
    {
      "name": "Robert Underwood",
      "affiliations": [
        2
      ]
    }
  ],
  "affiliations": [
    {
      "id": 1,
      "name": "University of Chicago"
    },
    {
      "id": 2,
      "name": "Argonne National Laboratory"
    }
  ],
  "keywords": [
    "scientific documents",
    "PDF parsing",
    "Adaptive Parallel PDF Parsing",
    "Resource Scaling",
    "direct preference optimization",
    "hardware requirements",
    "accuracy",
    "large-scale parsing"
  ],
  "title": "ADAPARSE: AN ADAPTIVE PARALLEL PDF PARSING AND RESOURCE SCALING ENGINE",
  "abstract": "Language models for scientific tasks are trained on text from scientific publications—most distributed as PDFs that require parsing. PDF parsing approaches range from inexpensive heuristics (for simple documents) to computationally intensive ML-driven systems (for complex or degraded ones). The choice of the \"best\" parser for a particular document depends on 1) its computational cost and 2) the accuracy of its output. To address these issues, we introduce an Adaptive Parallel PDF Parsing and Resource Scaling Engine (AdaParse), a data-driven strategy for assigning an appropriate parser to each document. We enlist scientists to select preferred parser outputs and incorporate this information through direct preference optimization (DPO) into AdaParse, thereby aligning its selection process with human judgment. AdaParse then incorporates hardware requirements and (aligned) predicted accuracy of each parser to orchestrate computational resources efficiently for large-scale parsing campaigns. We demonstrate that AdaParse, when compared to state-of-the-art parsers, improves throughput by 17× while still achieving comparable accuracy (actually, 0.2% better) on a benchmark set of 1000 scientific documents. AdaParse's combination of high accuracy and parallel scalability makes it feasible to parse large-scale scientific document corpora to support the development of high-quality, trillion-token-scale text datasets. The implementation is available at https://github.com/7shoe/AdaParse/ ."
}